#+TITLE: minimal_proxy/gen

* rsync
#+begin_example zsh
rsp-safe  ~/scripts/setup/minimal_proxy/.shared.sh x@y:
rsp-safe  ~/.inputrc x@y:
#+end_example

* [[https://github.com/webinstall/webi-installers][webinstall/webi-installers: Primary and community-submitted packages for webinstall.dev]]
#+begin_example zsh
source ~/.config/envman/PATH.env
#+end_example

** apt
#+begin_example zsh
sudo apt-get install -y tmux zsh openconnect jq python3 python3-pip
#+end_example

** brew
#+begin_example zsh
curl -sS https://webi.sh/brew | sh
#+end_example

Or:
#+begin_example zsh
tmuxnew brew-install zsh -c 'curl -sS https://webi.sh/brew | sh'
#+end_example

*** PATH
#+begin_example zsh
export PATH="${PATH}:${HOME}/.local/opt/brew/bin"
#+end_example

** pip
#+begin_example zsh
pip3 install -U speedtest-cli
#+end_example

** others
#+begin_example zsh
curl -sS https://webi.sh/webi | sh

curl -sS https://webi.sh/golang | sh
curl -sS https://webi.sh/go-essentials | sh

curl -sS https://webi.sh/ffmpeg | sh

curl -sS https://webi.sh/fd | sh

curl -sS https://webi.sh/fzf | sh

curl -sS https://webi.sh/jq | sh

# curl -sS https://webi.sh/docker | sh # NA
#+end_example

* tmux
#+begin_example zsh
rsp-safe ~/.tmux.conf 'ubuntu@185.235.42.146:'
#+end_example

* Caddy
#+begin_example zsh
tmux new -d -s 'serve-dl-caddy' caddy run --config ~/Caddyfile
#+end_example

#+begin_src bsh.dash :results verbatim :exports both :wrap results
reval-ec rsp-safe Caddyfile ubuntu@185.235.42.146:
#+end_src

#+RESULTS:
#+begin_results
rsp-safe Caddyfile ubuntu@185.235.42.146:

            306 100%    0.00kB/s    0:00:00
            306 100%    0.00kB/s    0:00:00 (xfr#1, to-chk=0/1)
            306 100%    0.00kB/s    0:00:00 (xfr#1, to-chk=0/1)
#+end_results

* v2ray
#+begin_example zsh
tmux new -d -s v2ray v2ray -config /usr/local/etc/v2ray/config.json
#+end_example

#+begin_example zsh
sudo cp ~/v2_server.json /usr/local/etc/v2ray/config.json
#+end_example

#+begin_src bsh.dash :results verbatim :exports both :wrap results
# reval-ec rsp-safe ./*.json ubuntu@185.235.42.146:
#+end_src
